[
  {
    "id": 0,
    "title": "Semáforo quebrado causando acidentes",
    "owner": "Olive Curry",
    "image": "https://www.acordacidade.com.br/fotos/p/229899-3.jpeg",
    "description": "Na rua onde moro, o poste de iluminação pública localizado próximo ao número 85 está apagado há várias semanas. Isso tem deixado a região muito escura durante a noite, o que gera uma sensação de insegurança para os moradores que transitam pela área. Diversos vizinhos já tentaram entrar em contato com a prefeitura, mas até agora nada foi feito. Além disso, a falta de iluminação favorece a ação de pessoas mal-intencionadas, tornando o local perigoso para quem chega tarde do trabalho ou para as crianças que retornam da escola em horários mais próximos ao entardecer. Urge uma solução para que o problema seja resolvido o mais rápido possível.",
    "location": {
      "position": {
        "lat": -22.887755,
        "long": -47.062854,
        "city": "Campinas"
      },
      "address": "Rua do Comércio, 150 - Centro"
    },
    "date": "25/09/2024",
    "relevance_points": 22,
    "solution": "A IA poderia sugerir a comunicação imediata com a autoridade de trânsito da cidade, explicando que o semáforo é vital para a segurança viária. A plataforma também pode gerar uma notificação de urgência, acompanhada de registros fotográficos, para o departamento de trânsito."
  },
  {
    "id": 1,
    "title": "Cheiro absurdo de maconha na região.",
    "owner": "Rhoda Foster",
    "image": "https://assets.b9.com.br/wp-content/uploads/2018/04/71749-1200x720.jpg",
    "description": "Cheiro absurdo de maconha na região. Essa gente não tem respeito pelas pessoas, ficam F1 em qualquer lugar, e a gente tem que aguentar esse cheiro maldito!",
    "location": {
      "position": {
        "lat": -23.682255,
        "long": -46.620854,
        "city": "Diadema"
      },
      "address": "R. Ferdinando Duca, 127 - Taboão"
    },
    "date": "12/09/2024",
    "relevance_points": 9,
    "solution": "Para resolver essa denúncia, a plataforma \"O Melhor Cidade\" poderia primeiramente identificar a localização exata do problema e gerar uma resposta automática informando ao denunciante as ações que podem ser tomadas dentro da legislação vigente. O sistema poderia sugerir que o usuário entre em contato com a guarda municipal ou com a polícia local, já que o uso de substâncias ilícitas em locais públicos é uma questão de ordem pública e segurança. Além disso, a plataforma poderia encaminhar a denúncia para as autoridades competentes, preservando o anonimato do denunciante, e sugerir o fortalecimento de campanhas de conscientização sobre o uso de drogas em espaços públicos na região, promovendo o diálogo entre a comunidade e os órgãos responsáveis."
  },
  {
    "id": 2,
    "title": "Buraco enorme na Rua das Flores",
    "owner": "Jimmy Freeman",
    "image": "https://cdn6.campograndenews.com.br/uploads/noticias/2022/02/07/1poq1g707goug.jpeg",
    "description": "Há um buraco enorme na Av. Dona Maria Rosa, quase na altura do cruzamento com a Rua das Flores. O buraco está ali há mais de dois meses, e já causou diversos acidentes, especialmente com motociclistas. Em dias de chuva, o buraco fica escondido pela água acumulada, o que piora ainda mais a situação. Além dos acidentes, ele tem gerado congestionamentos, pois os motoristas precisam desviar, o que reduz a fluidez do trânsito. Já fizemos algumas reclamações, mas não houve retorno até agora. O risco de acidentes mais graves aumenta a cada dia, principalmente à noite, quando a visibilidade é reduzida.",
    "location": {
      "position": {
        "lat": -23.555255,
        "long": -46.635354,
        "city": "São Paulo"
      },
      "address": "Rua das Flores, 345 - Vila Mariana"
    },
    "date": "15/09/2024",
    "relevance_points": 15,
    "solution": "A plataforma pode sugerir que o usuário envie a reclamação diretamente para a prefeitura local e indique a necessidade de manutenção urgente. A IA poderia explicar que, segundo a legislação municipal, buracos que afetam o trânsito devem ser reparados rapidamente. A plataforma também poderia gerar um relatório para os responsáveis pela manutenção urbana."
  },
  {
    "id": 3,
    "title": "Poste de luz quebrado há semanas",
    "owner": "Raymond Cook",
    "image": "https://img.cmswebsg.com.br/araraquaraagora.com/image?src=https://araraquaraagora.com/images/noticias/11247/10035730_Img0_600x4.jpg&w=1200&h=630&output=webp",
    "description": "O poste de luz na esquina está quebrado há semanas e a rua fica extremamente escura à noite, aumentando o risco de assaltos.",
    "location": {
      "position": {
        "lat": -22.967755,
        "long": -47.057964,
        "city": "Campinas"
      },
      "address": "Av. Barão de Itapura, 789 - Guanabara"
    },
    "date": "18/09/2024",
    "relevance_points": 12,
    "solution": "A resposta automática sugeriria contatar a concessionária responsável pela iluminação pública, com base na legislação que estipula prazos para reparos. A plataforma também poderia enviar um relatório às autoridades, destacando o risco à segurança pública, e fornecer o número de protocolo da reclamação."
  },
  {
    "id": 4,
    "title": "Lixo acumulado na praça",
    "owner": "Erik Lyons",
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcS-C5BclJsOdFUkcA1i3MT_ymuuGRheln1L8w&s",
    "description": "Um terreno baldio localizado na Rua Oliveira, próximo ao número 32, tem sido usado como depósito irregular de lixo. O local está repleto de entulho, sacos de lixo doméstico e até mesmo móveis velhos. Esse acúmulo de lixo atrai roedores e insetos, colocando em risco a saúde dos moradores próximos. Além disso, o mau cheiro tem se intensificado nos últimos dias, especialmente por conta do calor. Apesar de várias denúncias feitas à prefeitura, nenhuma ação foi tomada para limpar o terreno. A situação está se tornando insustentável e precisamos de uma solução urgente para a limpeza e, se possível, para a instalação de uma placa que proíba o descarte de lixo.",
    "location": {
      "position": {
        "lat": -23.000255,
        "long": -47.000854,
        "city": "Jundiaí"
      },
      "address": "Praça Central, 50 - Centro"
    },
    "date": "19/09/2024",
    "relevance_points": 18,
    "solution": "A IA poderia sugerir que o usuário entre em contato com a prefeitura, já que a responsabilidade da coleta de lixo é do município. Também indicaria que a denúncia pode ser encaminhada à vigilância sanitária, que pode multar a empresa responsável pela coleta."
  },
  {
    "id": 5,
    "title": "Árvore caída bloqueando rua",
    "owner": "Amy Hill",
    "image": "https://midias.agazeta.com.br/2022/11/25/arvore-caiu-em-madrugada-chuvosa-em-jardim-da-penha-vitoria-918037-article.jpeg",
    "description": "Uma árvore caiu após a última tempestade e está bloqueando completamente a rua. Ninguém veio remover, está perigoso!",
    "location": {
      "position": {
        "lat": -23.678255,
        "long": -46.559854,
        "city": "Santo André"
      },
      "address": "Rua das Acácias, 890 - Jardim"
    },
    "date": "21/09/2024",
    "relevance_points": 20,
    "solution": "A IA poderia informar o usuário sobre a legislação municipal, que exige a remoção rápida de obstáculos como árvores caídas. Sugeriria contatar a Defesa Civil e a secretaria de Meio Ambiente. A plataforma também poderia fornecer ao usuário uma atualização sobre as ações das autoridades locais para remover a árvore."
  },
  {
    "id": 6,
    "title": "Vazamento de água em via pública",
    "owner": "Todd Carlson",
    "image": "https://cdn6.campograndenews.com.br/uploads/noticias/2020/03/10/29gfjtpafta80.jpg",
    "description": "Há um vazamento de água na calçada, causando desperdício e erosão do pavimento. Já foi reportado, mas ninguém resolveu.",
    "location": {
      "position": {
        "lat": -23.554755,
        "long": -46.653854,
        "city": "São Paulo"
      },
      "address": "Av. Paulista, 900 - Bela Vista"
    },
    "date": "22/09/2024",
    "relevance_points": 14,
    "solution": "A IA pode sugerir ao usuário relatar o vazamento à companhia de saneamento local e indicar que, segundo a legislação, o reparo deve ocorrer rapidamente para evitar maiores danos. A plataforma poderia enviar a reclamação diretamente à companhia, acompanhada de fotos e localização precisa."
  }
]
